IDEA StatiCa Open Model
ReinforcedCrossSection.TendonDucts Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Tendon ducts
 Namespace: IdeaRS.OpenModel.CrossSection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public List<TendonDuct> TendonDucts { get; set; }
Public Property TendonDucts As List(Of TendonDuct)
	Get
	Set
public:
property List<TendonDuct^>^ TendonDucts {
	List<TendonDuct^>^ get ();
	void set (List<TendonDuct^>^ value);
}
Property Value
Type: List<TendonDuct>
See Also
Reference
ReinforcedCrossSection Class
IdeaRS.OpenModel.CrossSection Namespace